{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"25c1a5a9-229d-5e18-9992-c30e851f78b4","excerpt":"This example is a very simple analog clock. It consists of pixels that turn around a central point. To make this example work, we will focus on the function that creates our clock every time the canvas updates:","frontmatter":{"date":"April 14, 2019","path":"/docs/examples/analog-clock","title":"Analog Clock","chapter":2.1}}},{"node":{"id":"c431a0cd-33bd-538c-a120-81f553d774e0","excerpt":"Welcome to chapter 2. The examples. If you feel like there is a ton of stuff missing between the first chapter and this one, no worries, there is. To make it easier you can click the github link on the top right of the page and clone the repository…","frontmatter":{"date":"April 14, 2019","path":"/docs/examples","title":"Examples","chapter":2}}},{"node":{"id":"d65b30c7-50b2-517a-9972-2913e3d4d698","excerpt":"The matrix class is a second important class for this example. Especially the classes rotation function, which we will take a look at later in this document. We have to start at the beginning first. The two-dimensional Matrix Unlike in the movies…","frontmatter":{"date":"April 14, 2019","path":"/docs/classes/matrix-classes","title":"Matrix Classes","chapter":1.2}}},{"node":{"id":"b90f1c89-b591-5f1c-8028-b7445b4593e8","excerpt":"The first class we will build is the vector class. A vector can be described as a point in space, depending on dimensions. These vectors are the basis of our example, but they will also need the help of the  Matrix  to function properly. The two…","frontmatter":{"date":"April 14, 2019","path":"/docs/classes/vector-classes","title":"Vector Classes","chapter":1.1}}},{"node":{"id":"b7802668-e926-5075-a195-d8b0fdc76848","excerpt":"To build our WebGL2 example, we will need some classes. The application makes use of two types of classes:  Vector Classes  and  Matrix Classes . These classes will be part of the base of our application, together with shaders, buffers and programs…","frontmatter":{"date":"April 14, 2019","path":"/docs/classes","title":"Classes","chapter":1}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}