{"errors":[{"message":"Int cannot represent non-integer value: 1.1","locations":[{"line":10,"column":7}],"path":["markdownRemark","frontmatter","chapter"]}],"data":{"markdownRemark":{"html":"<p>The first class we will build is the vector class. A vector can be described as a point in space, depending on dimensions.<br>\nThese vectors are the basis of our example, but they will also need the help of the <a href=\"/docs/classes/matrix-classes\">Matrix</a> to function properly.</p>\n<h2>The two-dimensional vector</h2>\n<p>This is the most basic vector. It is a vector put in a two-dimensional space. The vector only has two coordinates: x and y. These have to be filled in in order to make this work.<br>\nLet's start by creating the class and a constructor:</p>\n<pre><code class=\"language-js\">export default class Vector2 {\n    constructor(xpos, ypos) {\n        this.x = xpos\n        this.y = ypos\n    }\n\n    ...\n}\n</code></pre>\n<p>The vector class also required quite a few functions to make it do what we want it to do.</p>\n<h2>Functions</h2>\n<h3>Basic vector operations</h3>\n<p>The vector has a few basic operations like <a href=\"#add-function\">add()</a>, <a href=\"#sub-function\">sub()</a> and <a href=\"#scalar-function\">scalar()</a></p>\n<h4><a name=\"add-function\"></a> add()</h4>\n<p>The add function allows us to add the coordinates of 2 vectors. Exactly like the name of the function says. </p>\n<pre><code class=\"language-js\">export default class Vector2 {\n    ...\n    add(secondVector) {\n        this.x += secondVector.x\n        this.y += secondVector.y\n    }\n}\n</code></pre>\n<p>What happens in this function is the following. We'll call this function with a second vector. The function will then add the coordinates of the second vector to the first vector, to move that first vector to a different place in our two-dimensional space.</p>\n<h4><a name=\"sub-function\"></a> sub()</h4>\n<p>The sub() function is built similarily to the add() function, but it's function is the exact opposite. Instead of adding a second vector to it to move the original vector, it will subtract the second vector from the original one.</p>\n<pre><code class=\"language-js\">export default class Vector2 {\n    constructor(xpos, ypos) {...}\n\n    add(secondVector) {...}\n\n    sub(secondVector) {\n        this.x -= secondVector.x\n        this.y -= secondVector.y\n    }\n\n}\n</code></pre>\n<h4><a name=\"scalar-function\"></a> scalar()</h4>\n<p>Can't you see what you do to me, baby?. You make me crazy, you make me act like a maniac. I'm like a lunatic, you make me sick. You're truly the only one who can do this to me. You just make me get so crazy. I go schizo, I get so insane I just go schizophrenic. One minute I wanna slit your throat, the next I wanna sex.</p>","frontmatter":{"date":"April 14, 2019","path":"/docs/classes/vector-classes","title":"Vector Classes","chapter":null,"chapter_title":"Classes","chapter_path":"docs/classes"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}